particle-iot/device-os/platform/MCU/rtl872x/src/flash_mal.c
bool FLASH_IsFactoryResetAvailable(void) {
    return false;
}

#if MODULE_FUNCTION == MOD_FUNC_BOOTLOADER
volatile int ipcResult = -1;
static void bldUpdateCallback(km0_km4_ipc_msg_t* msg, void* context) {
    if (!msg->data) {
        ipcResult = SYSTEM_ERROR_BAD_DATA;
    } else {
        DCache_Invalidate((uint32_t)msg->data, sizeof(int));
        ipcResult = *((int*)msg->data);
    }
}
#endif

// This function is called in bootloader to perform the memory update process
int FLASH_UpdateModules(void (*flashModulesCallback)(bool isUpdating)) {
    // FAC_RESET_SLOT is reserved for factory reset module
    const size_t module_count = MAX_MODULES_SLOT - GEN_START_SLOT;
    const size_t module_offs = DCT_FLASH_MODULES_OFFSET + sizeof(platform_flash_modules_t) * GEN_START_SLOT;
    platform_flash_modules_t modules[module_count];
    int r = dct_read_app_data_copy(module_offs, modules, sizeof(platform_flash_modules_t) * module_count);
    if (r != 0) {
        return FLASH_ACCESS_RESULT_ERROR;
    }
    int result = FLASH_ACCESS_RESULT_OK;
    bool has_modules = false;
    bool has_bootloader = false;
    size_t offs = module_offs;
    for (size_t i = 0; i < module_count; ++i) {
        platform_flash_modules_t* const module = &modules[i];
        if (module->magicNumber == 0xabcd) {
            bool resetSlot = true;
            if (!has_modules) {
                has_modules = true;
                // Turn on RGB_COLOR_MAGENTA toggling during flash update
                if (flashModulesCallback) {
                    flashModulesCallback(true);
                }
            }
            if (module->module_function != MODULE_FUNCTION_BOOTLOADER) {
                // Copy memory from source to destination based on flash device ID
                r = FLASH_CopyMemory(module->sourceDeviceID, module->sourceAddress, module->destinationDeviceID,
                        module->destinationAddress, module->length, module->module_function, module->flags);
                if (r != FLASH_ACCESS_RESULT_OK && result != FLASH_ACCESS_RESULT_RESET_PENDING) {
                    // Propagate errors, prioritize FLASH_ACCESS_RESULT_RESET_PENDING over errors
                    result = r;
                }
            } else {
#if MODULE_FUNCTION == MOD_FUNC_BOOTLOADER
                // Send IPC message to KM0 to perform the memory copy
                // Check if the memory copy can be performed.
                if (verify_module(module->sourceDeviceID, module->sourceAddress, module->length, module->destinationDeviceID,
                        module->destinationAddress, module->length, module->module_function, module->flags)) {
                    memcpy(&sModule, module, sizeof(platform_flash_modules_t));
                    if (sModule.flags & MODULE_DROP_MODULE_INFO) {
                        // Skip the module info header
                        if (sModule.length < sizeof(module_info_t)) { // Sanity check
                            result = FLASH_ACCESS_RESULT_BADARG;
                        }
                        sModule.sourceAddress += sizeof(module_info_t);
                        sModule.length -= sizeof(module_info_t);
                    }
                    int ret = km0_km4_ipc_send_request(KM0_KM4_IPC_CHANNEL_GENERIC, KM0_KM4_IPC_MSG_BOOTLOADER_UPDATE, &sModule,
                                                        sizeof(platform_flash_modules_t), bldUpdateCallback, NULL);
                    if (ret != 0 || ipcResult != 0) {
                        result = FLASH_ACCESS_RESULT_ERROR;
                        resetSlot = false;
                    } else {
                        has_bootloader = true;
                    }
                } else {
                    result = FLASH_ACCESS_RESULT_BADARG;
                }
#else
                result = FLASH_ACCESS_RESULT_BADARG; 
#endif
            }
            if (resetSlot) {
                // Mark the slot as unused
                module->magicNumber = 0xffff;
                r = dct_write_app_data(&module->magicNumber, offs + offsetof(platform_flash_modules_t, magicNumber), sizeof(module->magicNumber));
                if (r != 0 && result != FLASH_ACCESS_RESULT_RESET_PENDING) {
                    result = FLASH_ACCESS_RESULT_ERROR;
                }
            }
            if (has_bootloader) {
                break; // other valid module slots will be handled after reset
            }
        }
        offs += sizeof(platform_flash_modules_t);
    }
    if (has_bootloader) {
        result = FLASH_ACCESS_RESULT_RESET_PENDING;
    }
    // Turn off RGB_COLOR_MAGENTA toggling
    if (has_modules && flashModulesCallback) {
        flashModulesCallback(false);
    }
    return result;
}

int FLASH_ModuleInfo(module_info_t* const infoOut, uint8_t flashDeviceID, uint32_t startAddress, uint32_t* infoOffset) {
    CHECK_TRUE(infoOut, SYSTEM_ERROR_INVALID_ARGUMENT);
    uint32_t offset = 0;
    if (flashDeviceID == FLASH_INTERNAL) {
        int is = 0;
        bool enableRsip = enable_rsip_if_disabled(startAddress, &is);
        rtl_binary_header* header = (rtl_binary_header*)startAddress;
        if (header->signature_high == RTL_HEADER_SIGNATURE_HIGH && header->signature_low == RTL_HEADER_SIGNATURE_LOW) {
            offset = sizeof(rtl_binary_header);
        }
        int ret = hal_flash_read(startAddress + offset, (uint8_t*)infoOut, sizeof(module_info_t));
        disable_rsip_if_enabled(enableRsip, is);
        if (ret != SYSTEM_ERROR_NONE) {
            return ret;
        }
    } else if (flashDeviceID == FLASH_SERIAL) {
#ifdef USE_SERIAL_FLASH
        rtl_binary_header header = {};
        int ret = hal_exflash_read(startAddress, (uint8_t*)&header, sizeof(rtl_binary_header));
        if (ret != SYSTEM_ERROR_NONE) {
            return ret;
        }
        if (header.signature_high == RTL_HEADER_SIGNATURE_HIGH && header.signature_low == RTL_HEADER_SIGNATURE_LOW) {
            offset = sizeof(rtl_binary_header);
        }
        ret = hal_exflash_read(startAddress + offset, (uint8_t*)infoOut, sizeof(module_info_t));
        if (ret != SYSTEM_ERROR_NONE) {
            return ret;
        }
#else
        return SYSTEM_ERROR_NOT_SUPPORTED;
#endif
    }
    if (infoOffset) {
        *infoOffset = offset;
    }
    return SYSTEM_ERROR_NONE;
}

int FLASH_ModuleCrcSuffix(module_info_crc_t* crc, module_info_suffix_t* suffix, uint8_t flashDeviceID, uint32_t endAddress) {
    typedef int (*readFn_t)(uintptr_t addr, uint8_t* data_buf, size_t size);
    readFn_t read = NULL;

    int is = 0;
    bool enableRsip = false;
    if (flashDeviceID == FLASH_INTERNAL) {
        enableRsip = enable_rsip_if_disabled(endAddress, &is);
        read = hal_flash_read;
    } else if (flashDeviceID == FLASH_SERIAL) {
#ifdef USE_SERIAL_FLASH
        read = hal_exflash_read;
#else
        returrn SYSTEM_ERROR_NOT_SUPPORTED;
#endif
    }
    int ret = SYSTEM_ERROR_NONE;
    if (read) {
        if (crc) {
            ret = read(endAddress, (uint8_t*)crc, sizeof(module_info_crc_t));
            if (ret != SYSTEM_ERROR_NONE) {
                goto done;
            }
        }
        if (suffix) {
            // suffix [endAddress] crc32
            endAddress = endAddress - sizeof(module_info_suffix_t);
            ret = read(endAddress, (uint8_t*)suffix, sizeof(module_info_suffix_t));
        }
    }
done:
    disable_rsip_if_enabled(enableRsip, is);
    return ret;
}

uint32_t FLASH_ModuleAddress(uint8_t flashDeviceID, uint32_t startAddress) {
    module_info_t info = {};
    if (FLASH_ModuleInfo(&info, flashDeviceID, startAddress, NULL) == SYSTEM_ERROR_NONE) {
        return (uint32_t)info.module_start_address;
    }
    return 0;
}

